Revit 2024 API
BuiltInFailures.PathOfTravelFailures.UpdateSummary Property
 [Number] Path of Travel lines successfully updated. [Number] Path of Travel lines failed to update.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UpdateSummary { get; }
Visual Basic
Public Shared ReadOnly Property UpdateSummary As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UpdateSummary {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PathOfTravelFailures Class
Autodesk.Revit.DB Namespace